Revit 2027 API
FormatOptions(FormatOptions) Constructor
 Creates a copy of a FormatOptions object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions(
	FormatOptions other
)
Public Sub New (
	other As FormatOptions
)
public:
FormatOptions(
	FormatOptions^ other
)
new :
        other : FormatOptions -> FormatOptions
Parameters
other FormatOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormatOptions Class
FormatOptions Overload
Autodesk.Revit.DB Namespace